MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAG169/mcu.h
extern volatile __EMACxMCMDbits_t EMACxMCMDbits __asm__ ("EMACxMCMD") __attribute__((section("sfrs"), address(0xBF882290)));
extern volatile uint32_t        EMAC1MCMDCLR __attribute__((section("sfrs"),address(0xBF882294)));
extern volatile uint32_t        EMACxMCMDCLR __attribute__((section("sfrs"),address(0xBF882294)));
extern volatile uint32_t        EMAC1MCMDSET __attribute__((section("sfrs"),address(0xBF882298)));
extern volatile uint32_t        EMACxMCMDSET __attribute__((section("sfrs"),address(0xBF882298)));
extern volatile uint32_t        EMAC1MCMDINV __attribute__((section("sfrs"),address(0xBF88229C)));
extern volatile uint32_t        EMACxMCMDINV __attribute__((section("sfrs"),address(0xBF88229C)));
#define EMAC1MADR EMAC1MADR
extern volatile uint32_t   EMAC1MADR __attribute__((section("sfrs"), address(0xBF8822A0)));
typedef union {
  struct {
    uint32_t REGADDR:5;
    uint32_t :3;
    uint32_t PHYADDR:5;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MADRbits_t;
extern volatile __EMAC1MADRbits_t EMAC1MADRbits __asm__ ("EMAC1MADR") __attribute__((section("sfrs"), address(0xBF8822A0)));
#define EMACxMADR EMACxMADR
extern volatile uint32_t   EMACxMADR __attribute__((section("sfrs"), address(0xBF8822A0)));
typedef union {
  struct {
    uint32_t REGADDR:5;
    uint32_t :3;
    uint32_t PHYADDR:5;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMADRbits_t;
extern volatile __EMACxMADRbits_t EMACxMADRbits __asm__ ("EMACxMADR") __attribute__((section("sfrs"), address(0xBF8822A0)));
extern volatile uint32_t        EMAC1MADRCLR __attribute__((section("sfrs"),address(0xBF8822A4)));
extern volatile uint32_t        EMACxMADRCLR __attribute__((section("sfrs"),address(0xBF8822A4)));
extern volatile uint32_t        EMAC1MADRSET __attribute__((section("sfrs"),address(0xBF8822A8)));
extern volatile uint32_t        EMACxMADRSET __attribute__((section("sfrs"),address(0xBF8822A8)));
extern volatile uint32_t        EMAC1MADRINV __attribute__((section("sfrs"),address(0xBF8822AC)));
extern volatile uint32_t        EMACxMADRINV __attribute__((section("sfrs"),address(0xBF8822AC)));
#define EMAC1MWTD EMAC1MWTD
extern volatile uint32_t   EMAC1MWTD __attribute__((section("sfrs"), address(0xBF8822B0)));
typedef union {
  struct {
    uint32_t MWTD:16;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MWTDbits_t;
extern volatile __EMAC1MWTDbits_t EMAC1MWTDbits __asm__ ("EMAC1MWTD") __attribute__((section("sfrs"), address(0xBF8822B0)));
#define EMACxMWTD EMACxMWTD
extern volatile uint32_t   EMACxMWTD __attribute__((section("sfrs"), address(0xBF8822B0)));
typedef union {
  struct {
    uint32_t MWTD:16;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMWTDbits_t;
extern volatile __EMACxMWTDbits_t EMACxMWTDbits __asm__ ("EMACxMWTD") __attribute__((section("sfrs"), address(0xBF8822B0)));
extern volatile uint32_t        EMAC1MWTDCLR __attribute__((section("sfrs"),address(0xBF8822B4)));
extern volatile uint32_t        EMACxMWTDCLR __attribute__((section("sfrs"),address(0xBF8822B4)));
extern volatile uint32_t        EMAC1MWTDSET __attribute__((section("sfrs"),address(0xBF8822B8)));
extern volatile uint32_t        EMACxMWTDSET __attribute__((section("sfrs"),address(0xBF8822B8)));
extern volatile uint32_t        EMAC1MWTDINV __attribute__((section("sfrs"),address(0xBF8822BC)));
extern volatile uint32_t        EMACxMWTDINV __attribute__((section("sfrs"),address(0xBF8822BC)));
#define EMAC1MRDD EMAC1MRDD
extern volatile uint32_t   EMAC1MRDD __attribute__((section("sfrs"), address(0xBF8822C0)));
typedef union {
  struct {
    uint32_t MRDD:16;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MRDDbits_t;
extern volatile __EMAC1MRDDbits_t EMAC1MRDDbits __asm__ ("EMAC1MRDD") __attribute__((section("sfrs"), address(0xBF8822C0)));
#define EMACxMRDD EMACxMRDD
extern volatile uint32_t   EMACxMRDD __attribute__((section("sfrs"), address(0xBF8822C0)));
typedef union {
  struct {
    uint32_t MRDD:16;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMRDDbits_t;
extern volatile __EMACxMRDDbits_t EMACxMRDDbits __asm__ ("EMACxMRDD") __attribute__((section("sfrs"), address(0xBF8822C0)));
extern volatile uint32_t        EMAC1MRDDCLR __attribute__((section("sfrs"),address(0xBF8822C4)));
extern volatile uint32_t        EMACxMRDDCLR __attribute__((section("sfrs"),address(0xBF8822C4)));
extern volatile uint32_t        EMAC1MRDDSET __attribute__((section("sfrs"),address(0xBF8822C8)));
extern volatile uint32_t        EMACxMRDDSET __attribute__((section("sfrs"),address(0xBF8822C8)));
extern volatile uint32_t        EMAC1MRDDINV __attribute__((section("sfrs"),address(0xBF8822CC)));
extern volatile uint32_t        EMACxMRDDINV __attribute__((section("sfrs"),address(0xBF8822CC)));
#define EMAC1MIND EMAC1MIND
extern volatile uint32_t   EMAC1MIND __attribute__((section("sfrs"), address(0xBF8822D0)));
typedef union {
  struct {
    uint32_t MIIMBUSY:1;
    uint32_t SCAN:1;
    uint32_t NOTVALID:1;
    uint32_t LINKFAIL:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1MINDbits_t;
extern volatile __EMAC1MINDbits_t EMAC1MINDbits __asm__ ("EMAC1MIND") __attribute__((section("sfrs"), address(0xBF8822D0)));
#define EMACxMIND EMACxMIND
extern volatile uint32_t   EMACxMIND __attribute__((section("sfrs"), address(0xBF8822D0)));
typedef union {
  struct {
    uint32_t MIIMBUSY:1;
    uint32_t SCAN:1;
    uint32_t NOTVALID:1;
    uint32_t LINKFAIL:1;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxMINDbits_t;
extern volatile __EMACxMINDbits_t EMACxMINDbits __asm__ ("EMACxMIND") __attribute__((section("sfrs"), address(0xBF8822D0)));
extern volatile uint32_t        EMAC1MINDCLR __attribute__((section("sfrs"),address(0xBF8822D4)));
extern volatile uint32_t        EMACxMINDCLR __attribute__((section("sfrs"),address(0xBF8822D4)));
extern volatile uint32_t        EMAC1MINDSET __attribute__((section("sfrs"),address(0xBF8822D8)));
extern volatile uint32_t        EMACxMINDSET __attribute__((section("sfrs"),address(0xBF8822D8)));
extern volatile uint32_t        EMAC1MINDINV __attribute__((section("sfrs"),address(0xBF8822DC)));
extern volatile uint32_t        EMACxMINDINV __attribute__((section("sfrs"),address(0xBF8822DC)));
#define EMAC1SA0 EMAC1SA0
extern volatile uint32_t   EMAC1SA0 __attribute__((section("sfrs"), address(0xBF882300)));
typedef union {
  struct {
    uint32_t STNADDR5:8;
    uint32_t STNADDR6:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMAC1SA0bits_t;
extern volatile __EMAC1SA0bits_t EMAC1SA0bits __asm__ ("EMAC1SA0") __attribute__((section("sfrs"), address(0xBF882300)));
#define EMACxSA0 EMACxSA0
extern volatile uint32_t   EMACxSA0 __attribute__((section("sfrs"), address(0xBF882300)));
typedef union {
  struct {
    uint32_t STNADDR5:8;
    uint32_t STNADDR6:8;
  };
  struct {
    uint32_t w:32;
  };
} __EMACxSA0bits_t;
