MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1025DAG169/mcu.h
#define _CFGEBIC_EBIRDYINV1_POSITION             0x0000001D
#define _CFGEBIC_EBIRDYINV1_MASK                 0x20000000
#define _CFGEBIC_EBIRDYINV1_LENGTH               0x00000001

#define _CFGEBIC_EBIRDYINV2_POSITION             0x0000001E
#define _CFGEBIC_EBIRDYINV2_MASK                 0x40000000
#define _CFGEBIC_EBIRDYINV2_LENGTH               0x00000001

#define _CFGEBIC_EBIRDYINV3_POSITION             0x0000001F
#define _CFGEBIC_EBIRDYINV3_MASK                 0x80000000
#define _CFGEBIC_EBIRDYINV3_LENGTH               0x00000001

#define _CFGPG_CPUPG_POSITION                    0x00000000
#define _CFGPG_CPUPG_MASK                        0x00000003
#define _CFGPG_CPUPG_LENGTH                      0x00000002

#define _CFGPG_DMAPG_POSITION                    0x00000004
#define _CFGPG_DMAPG_MASK                        0x00000030
#define _CFGPG_DMAPG_LENGTH                      0x00000002

#define _CFGPG_USBPG_POSITION                    0x00000008
#define _CFGPG_USBPG_MASK                        0x00000300
#define _CFGPG_USBPG_LENGTH                      0x00000002

#define _CFGPG_CAN1PG_POSITION                   0x0000000C
#define _CFGPG_CAN1PG_MASK                       0x00003000
#define _CFGPG_CAN1PG_LENGTH                     0x00000002

#define _CFGPG_CAN2PG_POSITION                   0x0000000E
#define _CFGPG_CAN2PG_MASK                       0x0000C000
#define _CFGPG_CAN2PG_LENGTH                     0x00000002

#define _CFGPG_ETHPG_POSITION                    0x00000010
#define _CFGPG_ETHPG_MASK                        0x00030000
#define _CFGPG_ETHPG_LENGTH                      0x00000002

#define _CFGPG_SDHCPG_POSITION                   0x00000012
#define _CFGPG_SDHCPG_MASK                       0x000C0000
#define _CFGPG_SDHCPG_LENGTH                     0x00000002

#define _CFGPG_SQI1PG_POSITION                   0x00000014
#define _CFGPG_SQI1PG_MASK                       0x00300000
#define _CFGPG_SQI1PG_LENGTH                     0x00000002

#define _CFGPG_FCPG_POSITION                     0x00000016
#define _CFGPG_FCPG_MASK                         0x00C00000
#define _CFGPG_FCPG_LENGTH                       0x00000002

#define _CFGPG_GLCDPG_POSITION                   0x0000001A
#define _CFGPG_GLCDPG_MASK                       0x0C000000
#define _CFGPG_GLCDPG_LENGTH                     0x00000002

#define _CFGPG_GPUPG_POSITION                    0x0000001C
#define _CFGPG_GPUPG_MASK                        0x30000000
#define _CFGPG_GPUPG_LENGTH                      0x00000002

#define _CFGPG_ICD1PG_POSITION                   0x0000001E
#define _CFGPG_ICD1PG_MASK                       0xC0000000
#define _CFGPG_ICD1PG_LENGTH                     0x00000002

#define _CFGCON2_GPURESET_POSITION               0x00000000
#define _CFGCON2_GPURESET_MASK                   0x00000001
#define _CFGCON2_GPURESET_LENGTH                 0x00000001

#define _CFGCON2_SDWPPOL_POSITION                0x00000002
#define _CFGCON2_SDWPPOL_MASK                    0x00000004
#define _CFGCON2_SDWPPOL_LENGTH                  0x00000001

#define _CFGCON2_SDRDFTHR_POSITION               0x00000004
#define _CFGCON2_SDRDFTHR_MASK                   0x00003FF0
#define _CFGCON2_SDRDFTHR_LENGTH                 0x0000000A

#define _CFGCON2_SDWRFTHR_POSITION               0x00000010
#define _CFGCON2_SDWRFTHR_MASK                   0x03FF0000
#define _CFGCON2_SDWRFTHR_LENGTH                 0x0000000A

#define _CFGCON2_SDWPEN_POSITION                 0x0000001C
#define _CFGCON2_SDWPEN_MASK                     0x10000000
#define _CFGCON2_SDWPEN_LENGTH                   0x00000001

#define _CFGCON2_SDCDEN_POSITION                 0x0000001D
#define _CFGCON2_SDCDEN_MASK                     0x20000000
#define _CFGCON2_SDCDEN_LENGTH                   0x00000001

#define _CFGCON2_GLCDMODE_POSITION               0x0000001E
#define _CFGCON2_GLCDMODE_MASK                   0x40000000
#define _CFGCON2_GLCDMODE_LENGTH                 0x00000001

#define _CFGCON2_GLCDPINEN_POSITION              0x0000001F
#define _CFGCON2_GLCDPINEN_MASK                  0x80000000
#define _CFGCON2_GLCDPINEN_LENGTH                0x00000001

#define _CFGMPLL_MPLLIDIV_POSITION               0x00000000
#define _CFGMPLL_MPLLIDIV_MASK                   0x0000003F
#define _CFGMPLL_MPLLIDIV_LENGTH                 0x00000006

#define _CFGMPLL_INTVREFCON_POSITION             0x00000006
#define _CFGMPLL_INTVREFCON_MASK                 0x000000C0
#define _CFGMPLL_INTVREFCON_LENGTH               0x00000002

#define _CFGMPLL_MPLLMULT_POSITION               0x00000008
#define _CFGMPLL_MPLLMULT_MASK                   0x0000FF00
#define _CFGMPLL_MPLLMULT_LENGTH                 0x00000008

#define _CFGMPLL_MPLLVREGDIS_POSITION            0x00000016
#define _CFGMPLL_MPLLVREGDIS_MASK                0x00400000
#define _CFGMPLL_MPLLVREGDIS_LENGTH              0x00000001

#define _CFGMPLL_MPLLVREGRDY_POSITION            0x00000017
#define _CFGMPLL_MPLLVREGRDY_MASK                0x00800000
#define _CFGMPLL_MPLLVREGRDY_LENGTH              0x00000001

#define _CFGMPLL_MPLLODIV1_POSITION              0x00000018
#define _CFGMPLL_MPLLODIV1_MASK                  0x07000000
#define _CFGMPLL_MPLLODIV1_LENGTH                0x00000003

#define _CFGMPLL_MPLLODIV2_POSITION              0x0000001B
#define _CFGMPLL_MPLLODIV2_MASK                  0x38000000
#define _CFGMPLL_MPLLODIV2_LENGTH                0x00000003

#define _CFGMPLL_MPLLDIS_POSITION                0x0000001E
#define _CFGMPLL_MPLLDIS_MASK                    0x40000000
#define _CFGMPLL_MPLLDIS_LENGTH                  0x00000001

#define _CFGMPLL_MPLLRDY_POSITION                0x0000001F
#define _CFGMPLL_MPLLRDY_MASK                    0x80000000
#define _CFGMPLL_MPLLRDY_LENGTH                  0x00000001

#define _NVMCON_NVMOP_POSITION                   0x00000000
#define _NVMCON_NVMOP_MASK                       0x0000000F
#define _NVMCON_NVMOP_LENGTH                     0x00000004

#define _NVMCON_BFSWAP_POSITION                  0x00000006
#define _NVMCON_BFSWAP_MASK                      0x00000040
#define _NVMCON_BFSWAP_LENGTH                    0x00000001

#define _NVMCON_PFSWAP_POSITION                  0x00000007
#define _NVMCON_PFSWAP_MASK                      0x00000080
#define _NVMCON_PFSWAP_LENGTH                    0x00000001

